#+TITLE: Second Life UPS Mark II

*** More power

After [[file:secondlife-ups.org][Secondlife UPS Mark I]] has been deployed there have been a number of changes and additions to my home infrastructure equipment rack. Power requirements have
increased. In order to come up with more detailed power requirements for each voltage  I measured the amount of current draw during normal operation for each
piece of equipment and came up with the following calculations for the power budget requirements of the UPS. As the voltage on the V_rail bus is not constant and
changes from 11.2V when operating on a discharged battery and 24V when operating on AC its more useful to specify it's performance in terms of power not current.

#+CAPTION: Devices connected to the UPS
#+ATTR_HTML: :border 2 :rules all :frame border
#+NAME: devices
|-----------------------------+----------------------------+-----------------------+----------------------+-----------------------------+------------------------+-----------------------------------------------------------------------------------------------------------|
| Device                      | 12V Current [A] (measured) | 12V Current [A] (max) | 5V Current [A] (max) | V_rail power [W] (measured) | V_rail power [W] (max) | Notes                                                                                                     |
|-----------------------------+----------------------------+-----------------------+----------------------+-----------------------------+------------------------+-----------------------------------------------------------------------------------------------------------|
| Router                      |                            |                     5 |                      |                             |                        | Axiomtek NA342                                                                                            |
| GPON Modem                  |                            |                   0.5 |                      |                             |                        | [[https://halny.com/portfolio/hl-1ge][HALNY HL-1GE]]                                                                                              |
| Core Ethernet switch        |                       1.33 |                     4 |                      |                             |                        |                                                                                                           |
| Planet GSD-800S switch      |                            |                       |                      |                             |                     21 | PoE injected                                                                                              |
| Ubiquity Unify AC Lite AP   |                       0.16 |                  0.54 |                      |                             |                        | Via boost converter and PoE injected, rated at 6.5 W (see [[https://dl.ui.com/datasheets/unifi/UniFi_AC_APs_DS.pdf][datasheet]]), passive 24V PoE Mode B (230V/0.02A) |
| Raspberry Pi                |                            |                       |                  2.1 |                             |                        |                                                                                                           |
| Gate magnetic lock          |                       0.25 |                       |                      |                             |                        |                                                                                                           |
| [[https://wikidevi.wi-cat.ru/Netgear_ReadyNAS_3138][Network Attached Storage]]    |                            |                       |                      |                          40 |                    100 | Built-in ATX power supply is 180W but real power draw has not exceeded 100W                               |
| Network Video Recorder      |                            |                       |                      |                             |                     40 | Boost converter to 48V                                                                                    |
| Security Cameras (total)    |                       0.75 |                       |                      |                             |                        |                                                                                                           |
| Miscelaneous (ie. rack fan) |                            |                   0.5 |                  0.5 |                             |                        |                                                                                                           |
|-----------------------------+----------------------------+-----------------------+----------------------+-----------------------------+------------------------+-----------------------------------------------------------------------------------------------------------|
| Total                       |                       2.49 |                 10.54 |                  2.6 |                          40 |                    161 |                                                                                                           |
|-----------------------------+----------------------------+-----------------------+----------------------+-----------------------------+------------------------+-----------------------------------------------------------------------------------------------------------|
#+TBLFM: @>$2=vsum(@II..@III)::@>$3=vsum(@II..@III)::@>$4=vsum(@II..@III)::@>$5=vsum(@II..@III)::@>$6=vsum(@II..@III)

*** Capacity planning for power buses

We take into account an efficiency of 0.8 for the buck converters and assume that the lowest battery voltage will be 11.2V which corresponds to the BMS cutoff voltage of 
2.8V per cell (11.2V = 3 * 2.8V).

#+CAPTION: Maximum current and power values for each bus
#+NAME: bus_load_capacity
|---+-------------------------------+-------------+-----------------+---------------+-------------------------------+-----------------------------|
| $ | minimum_battery_voltage=11.2  |             |                 |               |                               |                             |
| $ | voltage_on_ac=24              |             |                 |               |                               |                             |
| $ | buck_converter_efficiency=0.8 |             |                 |               |                               |                             |
|---+-------------------------------+-------------+-----------------+---------------+-------------------------------+-----------------------------|
|   | Bus                           | Voltage [V] | Max current [A] | Max power [W] | V_rail load on batt power [A] | V_rail load on AC power [A] |
|---+-------------------------------+-------------+-----------------+---------------+-------------------------------+-----------------------------|
| # | 12 V                          |          12 |           10.54 |        126.48 |                     14.116071 |                        5.02 |
| # | 5 V                           |           5 |             2.6 |           13. |                     1.4508929 |                      0.4375 |
| # | Direct                        |             |                 |           161 |                        14.375 |                   6.7083333 |
|---+-------------------------------+-------------+-----------------+---------------+-------------------------------+-----------------------------|
| # | Total                         |             |                 |        300.48 |                     29.941964 |                   12.165833 |
|---+-------------------------------+-------------+-----------------+---------------+-------------------------------+-----------------------------|
#+TBLFM: @5$4=remote(devices, @>$3)::@6$4=remote(devices, @>$4)::@7$5=remote(devices, @>$6)
#+TBLFM: @5$5=$3 * $4::@6$5=$3 * $4::$7=$5 / $voltage_on_ac
#+TBLFM: @5$6=$-1 / $buck_converter_efficiency / $minimum_battery_voltage::@6$6=$-1 / $buck_converter_efficiency / $minimum_battery_voltage::@7$6=$-1 / $minimum_battery_voltage
#+TBLFM: @>$5=vsum(@III..@IIII)::@>$6=vsum(@III..@IIII)

All of the above calculations allow us to select:

- internal wiring cross-section (AWG)
- internal and external connector types
- fuses
- buck converters maximum power and current
- AC power supply maximum power and current

An AC power supply with at least 300W is needed to power the loads with some room needed to charge the battery. For this reason a 400W power supply has been selected
(see summary in BOM).

* Bill of Materials

- Shipping costs and taxes are not included.
- All prices are in EUR.

#+CAPTION: Bill of Materials
|-------------------------------------+---------------------------+------------------------------------------------------------------------------------------------------------------------------+------+--------+----------------------+------------------+------------------+---------------------|
| Item                                | Type                      | Description                                                                                                                  | Unit | Amount | Price per unit [EUR] | Line total [EUR] | Purchase date    | Notes               |
|-------------------------------------+---------------------------+------------------------------------------------------------------------------------------------------------------------------+------+--------+----------------------+------------------+------------------+---------------------|
| Battery cells                       | Various                   | Li-Ion 3.6V 18650 Cells                                                                                                      | pcs  |     96 |                    0 |                0 | N/A              | From existing stock |
| AC Power supply                     | [[https://www.aliexpress.com/item/32950139524.html][Coleen CB-400W-24V]]        | AC 230V, 24V/16.6A                                                                                                           | pcs  |      1 |                 19.9 |             19.9 | <2023-04-07 pią> |                     |
| Battery fuse socket                 | [[https://www.tme.eu/pl/katalog/gniazda-bezpiecznikowe-na-panel_113040/?art=PMG-KB-01-Q2S][PMG-KB-01-Q2S]]             | Fuse holder; 10.3x38.1mm; 30A; on panel; Cutout: Ø22.4mm; UL94V-1                                                            | pcs  |      1 |                 8.77 |             8.77 | <2023-04-07 pią> |                     |
| Battery fuse                        | [[https://www.tme.eu/pl/en/details/0090.0030/fuses-10-3x38mm-fast/schurter/][0090.0030 SCHURTER]]        | Fuse: fuse; gPV; 30A; 1kVDC; ceramic,cylindrical,industrial; ASO                                                             | pcs  |      1 |                 8.68 |             8.68 | <2023-07-13>     |                     |
| 12V Buck Converter                  | [[https://www.aliexpress.com/item/1005002603980974.html][DN121]]                     | VOLTAGE REGULATOR 24V to 12V 10A DC/DC Converter Step Down Voltage Transformer Buck Regulator Voltage for Solar for LED      | pcs  |      1 |                 8.62 |             8.62 | <2023-03-15 śro> |                     |
| 5V Buck Converter                   | [[https://pl.aliexpress.com/item/1005004778421166.html][LM2596 Step Down Module]]   | LM2596 Step Down Module DC to DC Adjustable Buck                                                                             | pcs  |      1 |                 3.00 |               3. | <2023-03-15 śro> |                     |
| CC/CV Charger                       | [[https://www.aliexpress.com/item/1005004153906058.html][XL4015]]                    | Efficient Adjustable 5A DC-DC Buck Module Constant Current Voltage Regulator Step Down Converter Charging Board 5V 12V 24V   | pcs  |      1 |                 2.31 |             2.31 | <2023-03-15 śro> |                     |
| Battery Management System           | [[https://www.aliexpress.com/item/1005002066419577.html][EGBO Store 4S/100A]]        | 3s 4s 5s Bms 12v 16.8v 21v 3.7v 100a Li-ion Lmo Ternary Lithium Battery Protection Circuit Board Li-polymer Balance Charging | pcs  |      1 |                 2.27 |             2.27 | <2023-05-07>     |                     |
| Pluggable terminal blocks (sockets) | [[https://www.tme.eu/Document/83e7173fe653a2d0e44585e87978945b/opr014R8.pdf][15EDGVC-3.5-02P-14-00A(H)]] | Pluggable terminal block; 3.5mm; ways: 2; straight; socket; male                                                             | pcs  |     16 |                 0.19 |             3.04 | <2023-04-07 pią> |                     |
| Pluggable terminal blocks (plugs)   | [[https://www.tme.eu/Document/580c900c7460c0af0ff973aec46ec4f5/15edgk.pdf][15EDGK-3.5-02P-14-00AH]]    | Pluggable terminal block; 3.5mm; ways: 2; straight; plug; female                                                             | pcs  |     20 |                 0.42 |              8.4 | <2023-04-07 pią> | 4 spare units       |
|-------------------------------------+---------------------------+------------------------------------------------------------------------------------------------------------------------------+------+--------+----------------------+------------------+------------------+---------------------|
| Total                               |                           |                                                                                                                              |      |        |                      |            67.18 |                  |                     |
|-------------------------------------+---------------------------+------------------------------------------------------------------------------------------------------------------------------+------+--------+----------------------+------------------+------------------+---------------------|
#+TBLFM: $7=$5 * $6::@>$7=vsum(@II..@III)
